<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>

<head>
  <title>SAFET: Operación Listar Datos</title>
  <meta name="GENERATOR" content="Quanta Plus">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h3>12.4.1.-operacion:Listar_datos:</h3><br>

<p>
<div align="justify">Esta operaci&oacute;n permite listar informaci&oacute;n de las variables, de acuerdo a un determinado estado (Nuevo- >Aceptado->Cerrado->FirmadoCerrado, etc) en que se encuentre. Para realizar esta operaci&oacute;n se requiere hacer click sobre <code>operacion:Listar_datos</code> del men&uacute; inteligente, y en el &aacute;rea de cuadro de edici&oacute;n debe aparecer la linea de texto <code>operacion:Listar_datos</code>, (ver figura S3.2.1-1) aparte debe aparece el men&uacute; inteligente con los campos relacionados con esta operaci&oacute;n (ver figura S3.2.1-2)</div></p><br>
<br>
<p align="center"><IMG src="images/operacion-listar-datos.png" width="700" height="197" border="0"></p>
<div align="center">figura S3.2.1-1. &Aacute;rea cuadro de edici&oacute;n, selecci&oacute;n de la <code>operacion:Listar_datos</code></div><br>
<br>
<p align="center"><IMG src="images/operacion-listar-datos-menu.png" width="469" height="265" border="0"></p>
<div align="center">figura S3.2.1-2. Men&uacute; inteligente, campos de la operaci&oacute;n <code>Listar_datos</code></div><br>
<br>

<p>
<div align="justify">Para listar la informaci&oacute;n de los tickets debe seleccionar el documento de flujo de trabajo a consultar, debe hacer click sobre el <code>campo cargar_archivo_flujo*</code> del men&uacute; inteligente, debe aparecer en el &aacute;rea de cuadro la linea de texto <code>operacion:Cargar_archivo_flujo</code> junto con un bot&oacute;n de selecci&oacute;n para marcar el documento de flujo de trabajo a consultar (ver figura S3.2.1-3). Los documentos de flujo de trabajo por omisi&oacute;n se deben guardar en la ruta {<code>/home/usuario}/.safet/flowfiles/</code> (en este ejemplo el usuario puede sustituirse por pbuitrago). Debe ser incluido en el archivo de configuraci&oacute;n <code>safet.conf</code> que se encuentra en el directorio <code>/home/usuario/.safet/safet.conf</code> en la sección <code>“ [Widgets] ”</code> (ver figura S3.2.1-4)
</div><br>
</p><br>
<p align="center"><IMG src="images/operacion-listar-datos-cargar-archivo.png" width="700" height="225" border="0"></p>
<div align="center">figura S3.2.1-3. Seleccionar el documento de flujo de trabajo a consultar</div><br>
<br>
<p align="center"><IMG src="images/archivoXml.png" width="700" height="67" border="0"></p>
<div align="center">Figura S3.2.1-4. Archivo <code>safet.conf</code>, sección <code>[ Widgets ]</code> documentos de flujo de trabajo</div><br>
<br>

<p>
En este ejemplo tengo incluido en el archivo safet.conf solo dos documentos de flujo de trabajo (ticketstrac.xml y ticketstracavanzado.xml). Luego de seleccionar el documento de flujo de trabajo a consultar se click sobre el campo <code>Variable*</code> del men&uacute; inteligente, y en el &aacute;rea de cuadro de edici&oacute;n debe aparecer la linea de texto Variable, junto con un bot&oacute;n de selecci&oacute;n para marcar el estado que quiere listar (ver figura S3.2.1-5), y hace click en el bot&oacute;n enviar, si no presento problema, se muestra en la parte inferior izquierda del cuadro de dialogo el mensaje:<br>
<br>
<code>
Consulta fue exitosa....ok!<br>
Ver reporte<br>
</code>
(ver figura S3.2.1-6).
Este procedimiento genera un reporte de las variables que se encuentra en el estado seleccionado ver figura (ver figura S3.2.1-7)
</p><br>
<br>
<p align="center"><IMG src="images/operacion-listar-datos-variable.png" width="700" height="257" border="0"></p>
<div align="center">Figura S3.2.1-5. Selecci&oacute;n del estado a consultar</div><br>
<br>
<p align="center"><IMG src="images/resultado-consulta.png" width="700" height="166" border="0"></p>
<div align="center">Figura S3.2.1-6. Mensaje, resultado de la consulta</div><br>
<br>
<p align="center"><IMG src="images/reporte-variable.png" width="700" height="652" border="0"></p>
<div align="center">Figura S3.2.1-7. reporte de consulta de las variables en un determinado estado</div><br>
<br>
</body>
</html>
