<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>

<head>
  <title>SAFET: Glosario de Terminos</title>
  <meta name="GENERATOR" content="Quanta Plus">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h1>17.- Glosario de termino</h1><br>

<ul>
<LI>
<strong>Algoritmo:</strong> Funciones matem&aacute;ticas, como las que se usan para cifrar de descifrar informaci&oacute;n.
</LI><br>

<LI>
<strong>Autenticación:</strong> La acci&oacute;n de verificar informaci&oacute;n, como identidad, propiedad o autorizaciÇ&oacute;n.
</LI><br>

<LI>
<strong>Autorización:</strong> El otorgamiento de privilegios de acceso apropiados a usuarios autenticados.
</LI><br>

<LI>
<strong>AC:</strong> Autoridad de Certificaci&oacute;n, emitir&aacute; a petici&oacute;n de la Autoridad de Registro los certificados que se precisen de forma automatizada
</LI><br>

<LI>
<strong>Algoritmo asim&eacute;trico:</strong> Algoritmo matem&aacute;tico que utiliza dos claves: una (p&uacute;blica/privada), utilizada para descifrar, y la otra (p&uacute;blica/privada), empleada para cifrar. 
</LI><br>

<LI>
<strong>Algoritmo sim&eacute;trico:</strong> Algoritmo matem&aacute;tico que utiliza la misma clave (clave sim&eacute;trica) para cifrar y descifrar.
</LI><br>

<LI>
<strong>AR:</strong> Autoridad de registro, Autorizada por la AC para registrar a los usuarios que solicitan los certificados digitales al proveedor de servicios de certificado digitales.
</LI><br>

<LI>
<strong>BD:</strong> Base de dato
</LI><br>

<LI>
<strong>Certificado digital:</strong> Es un documento electr&oacute;nico, en el cual la AC acredita mediante su firma digital que la clave p&uacute;blica pertenece a su propietario. Tambi&eacute;n se denominan certificados de usuario y de clave p&uacute;blica.
</LI><br>

<LI>
<strong>Cifrado:</strong> La transformaci&oacute;n de texto claro en una forma aparentemente menos legible (texto cifrado), a trav&eacute;s de un proceso matem&aacute;tico.
</LI><br>

<LI>
<strong>Clave privada:</strong> Clave personal que no es conocida por el resto de los usuarios y que es utilizada para crear firmas digitales y para descifrar mensajes cifrados con la correspondiente clave p&uacute;blica.
</LI><br>

<LI>
<strong>Clave p&uacute;blica:</strong> Clave de usuario que es conocida por el resto de los usuarios y que es utilizada para verificar firmas creadas con su correspondiente clave p&uacute;blica y se usa para cifrar mensajes que pueden ser descifrados con su correspondiente clave privada.
</LI><br>


<LI>
<strong>Clave simétrica:</strong> Clave utilizada en los algoritmo simétricos para cifrar y descifrar los mensajes.
</LI><br>

<LI>
<strong>CRLs:</strong> Certificate Revocation List, Listas de Certificados revocados. Definido en la norma X.509.
</LI><br>

<LI>
<strong>CRRs:</strong> Certificate Revocation Requests.
</LI><br>

<LI>
<strong>CSRs:</strong> Certificate Signing Request.
</LI><br>

<LI>
<strong>DCP:</strong> Declaraci&oacute;n de Pr&aacute;cticas de Certificaci&oacute;n.
</LI><br>

<LI>
<strong>Emisi&oacute;n de certificados:</strong> Acciones llevadas a cabo por una PSC para crear un certificado y comunic&aacute;rselo al usuario que lo solicit&oacute;.
</LI><br>

<LI>
<strong>Expiraci&oacute;n de un certificado:</strong> Fecha y hora especificadas en un certificado cuando termina el per&iacute;odo operativo del mismo.
</LI><br>

<LI>
<strong>Firma digital:</strong> Es un documento electr&oacute;nico que se genera como resultado de aplicar una funci&oacute;n matem&aacute;tica al documento a firmar y posteriormente, cifrar el resultado con la clave privada del firmante. Es utilizada por el emisor de un mensaje para identificarse.
</LI><br>

<LI>
<strong>ICP:</strong> Conjunto de mecanismos de cifrado de clave p&uacute;blica basados en la existencia de dos claves (una p&uacute;blica y otra privada) que se utilizan para garantizar la identidad del usuario, la confidencialidad y la integridad de la informaci&oacute;n transmitida.
</LI><br>

<LI>
<strong>LCR:</strong> Listados de Certificados Revocados.
</LI><br>

<LI>
<strong>LDAP:</strong> Light Directory Access Protocol. Protocolo para acceder a datos y buscar contenidos en directorios normalizados.
</LI><br>

<LI>
<strong>OCSP:</strong> Online Certificate Status Protocol. El protocolo de estado de certificado en l&iacute;nea. Permite la delegaci&oacute;n de la validaci&oacute;n del certificado. Ofrece repuesta inmediata y actualizada en las consultas de los estados de los certificados.
</LI><br>

<LI>
<strong>PSC:</strong> Proveedor de Servicios de Certificaci&oacute;n
</LI><br>

<LI>
<strong>PIN:</strong> N&uacute;mero de Identificaci&oacute;n Personal. N&uacute;mero solo conocido por el titular de la tarjeta, y que sirve para empezar a operar con &eacute;sta.
</LI><br>

<LI>
<strong>PKI:</strong> Public Key Infraestructure. Infraestructura de Clave P&uacute;blica.
</LI><br>

<LI>
<strong>Revocaci&oacute;n de certificados:</strong> Anulaci&oacute;n de la validez de un certificado de clave p&uacute;blica antes de finalizar de per&iacute;odo de validez.
</LI><br>

<LI>
<strong>SSL:</strong> Secure Socket Layer. Nivel de conexiones seguras. Es un protocolo para cifrar el tr&aacute;fico de transacciones en una red.
</LI><br>

<LI>
<strong>SUSCERTE:</strong> Superintendecia de Servicios de Certificaci&oacute;n Electr&oacute;nica.
</LI><br>

<LI>
<strong>Tarjeta Inteligente:</strong> Tarjeta incluye un microprocesador y es utilizada para proporcionar seguridad de la informaci&oacute;n.
</LI><br>

<LI>
<strong>Trac:</strong> Es un sistema web libre para la gesti&oacute;n de proyectos y seguimientos de errores
</LI><br>

<LI>
<strong>Wiki:</strong> Sistema web que permite la edici&oacute;n de sus contenidos por parte de los usuarios
</LI><br>

<LI>
<strong>X509:</strong> Norma est&aacute;ndar que define el certificado digital.
</LI><br>
</ul>

</body>
</html>
