<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>

<head>
  <title>SAFET: Operaci&oacute;n Firmar Electr&oacute;nicamente un Archivo</title>
  <meta name="GENERATOR" content="Quanta Plus">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h3>12.5.1.- operacion:Firmar_electronicamente_un_archivo</h3>

<div align="justify">Esta operaci&oacute;n permite tomar un documento digital y aplicarle firma electr&oacute;nica, Para realizar esta operaci&oacute;n se requiere hacer click sobre la operaci&oacute;n firmar del men&uacute; inteligente, y en el &aacute;rea de edici&oacute;n debe aparecer la linea de texto <code>operacion:Firmar_electronicamente_un_archivo</code> (ver figura S3.3.1-1) aparte debe aparecer el men&uacute; inteligente los campos relacionadas con esta operaci&oacute;n (ver figura S3.3.1-2)
</div><br>
<br>

<p align="center"><IMG src="images/operacion-firmar-electronicamente-archivo.png" width="700" height="212" border="0"></p>
<div align="center">figura S3.3.1-1. &Aacute;rea cuadro de edici&oacute;n, selecci&oacute;n de la <code>operacion:firmar_Firmar_electronicamente_un_archivo</code></div><br>
<br>

<p align="center"><IMG src="images/operacion-firmar-menu-inteligente.png" width="611" height="357" border="0"></p>
<div align="center">figura S3.3.1-2. Menú inteligente, campos de la operación <code>Firmar_electronicamente_un_archivo</code></div><br>
<br>

<div align="justify">Se requiere cargar el documento digital que se va a firmar, para la misma se debe hacer click sobre el campo <code>cargar_Archivo*</code> men&uacute; inteligente, y debe aparecer en el cuadro de edición la linea de texto <code>Cargar_archivo:</code> junto con un bot&oacute;n de selecci&oacute;n donde se debe marcar el documento digital que se le aplicara la firma. Si el documento de flujo de trabajo no esta agregado en el archivo <code>safet.conf</code> lo puedes seleccionar haciendo click al bot&oacute;n  <IMG src="images/boton-buscar.png" width="27" height="22" align="texttop" border="0"><br>
<br>

<p>
se despliega una ventana donde debe seleccionar el documento a firmar (ver figura S3.3.1-3)
</p><br>
<br>

<p align="center"><IMG src="images/operacion-firmar-seleccionar-documento-firmar.png" width="700" height="467" border="0"></p>
<div align="center">figura S3.3.1-3. Seleccionar el documento para aplicar la firma electr&oacute;nica</div><br>
<br>

<div align="justify">luego debe seleccionar o crear un contenedor donde se almacena el documento firmado, para la misma debe hacer click sobre el campo <code>Nombre_contenedor</code> del men&uacute; inteligente, debe aparecer en el cuadro de edici&oacute;n la linea de texto <code>Nombre_contenedor</code> junto con un bot&oacute;n de selecci&oacute;n donde debe marcar el contenedor. Si el contenedor no existe, debe crearlo haciendo click sobre el bot&oacute;n. <IMG src="images/boton-buscar.png" width="27" height="22" align="texttop" border="0"><br>
</div><br>

<p>
Debe seleccionar el directorio y el nombre del archivo donde se va a guardar ver (figura S3.3.1-4)
</p><br>
<br>

<p align="center"><IMG src="images/operacion-firmar-crear-contenedor.png" width="700" height="465" border="0"></p>
<div align="center">Figura S3.3.1-4. Crear contenedor</div><br>
<br>

<div align="justify">luego se procede a enviar, haciendo click en el bot&oacute;n Enviar Firma/Certificados, el sistema solicitara que ingrese el pin de la tarjeta inteligente. (ver figura S3.3.1-5)
</div><br>
<br>

<p align="center"><IMG src="images/operacion-firmar-ingresar-pin-tarjeta.png" width="700" height="437" border="0"></p>
<div align="center">Figura S3.3.1-5. Ingresar el pin de la tarjeta inteligente.</div><br>
<br>

<div align="justify">Si todo el proceso sale bien se muestra en un cuadro de informaci&oacute;n que aparece en la parte inferior derecha si la operaci&oacute;n fue exitosa (ver figura S3.3.1-6) y muestra informaci&oacute;n sobre la operaci&oacute;n como:
</div><br>
<br>
<p align="center"><IMG src="images/resultado-operacion-firma.png" width="700" height="194" border="0"></p>
<div align="center">Figura S3.3.1-6. Mensaje, Resultado de la operaci&oacute;n</div>

</div>
</body>
</html>
