<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>

<head>
  <title>SAFET: M&oacute;dulo Realizar Consultas</title>
  <meta name="GENERATOR" content="Quanta Plus">
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head>
<body>
<h2>12.4- M칩dulo Realizar Consultas</h2><br>

<p>Para acceder a este m칩dulo se hace click en el bot&oacute;n Realizar Consultas (ver figura S3.2-1)</p><br>
<br>
<p align="center"><IMG src="images/moduloRealizarConsulta.png" width="241" height="171" border="0"></p>
<div align="center">Figura S3.2-1. selecci&oacute;n del bot&oacute;n Realizar Consultas</div><br>
<br>
<p>
Y se desplegara una ventana (ver figura S3.2-2) donde se proceder&aacute; a realizar las operaciones correspondiente a este m&oacute;dulo
</p><br>
<br>
<p align="center"><IMG src="images/modulo-consulta-menu.png" width="373" height="241" border="0"></p>
<div align="center">Figura S3.2-2. Men&uacute; inteligente, Operaciones del m&oacute;dulo Realizar Consultas</div><br>
<br>

<p>En el men&uacute; inteligente aparecen tres (3) secciones, en las cuales se pueden realizar diferentes operaciones, las secciones son: Opciones de listado, Gr&aacute;ficos b&aacute;sicos y Gr&aacute;ficos con filtros.
</p><br>

<ul>
<strong>Opciones de listado</strong><br>

<LI>
<strong>operacion:Listar_datos:</strong> esta operaci&oacute;n permite listar la informaci&oacute;n de los ticket.
</LI><br>

<LI>
<strong>operacion:Listar_datos_con_autofiltro:</strong> 
</LI><br>
<br>

<strong>Gr&aacute;ficos b&aacute;sicos</strong><br>

<LI>
<strong>operacion:Generar_gr&aacute;fico_coloreado:</strong> esta operaci&oacute;n permite visualizar el flujo de trajo agregando color a cada uno de los estados
</LI><br>

<LI>
<strong>operacion:Generar_gr&aacute;fico_para_clave:</strong> esta operaci&oacute;n permite visualizar el flujo de trabajo de acuerdo con el id de uno de los ticket
</LI><br>

<strong>Gr&aacute;ficos con filtros</strong><br>

<LI>
<strong>operacion:Generar_gr치fico_con_autofiltro:</strong> esta operaci&oacute;n permite visualizar el flujo de trabajo de acuerdo a una clasificaci&oacute;n autom&aacute;tica de valores desde un determinado campo, construyendo autom&aacute;ticamente nuevos estados que contiene informaci&oacute;n relacionado con el flujo de trabajo en general.
</LI><br>

<LI>
<strong>operacion:Generar_gr치fico_con_filtrorecursivo:</strong> esta operaci&oacute;n permite visualizar el flujo de trabajo en funci&oacute;n de relaciones recursivas entre los registros de la base de datos, por ejemplo: en caso de divisi&oacute;n por sub-tareas.
</LI><br>
</ul>

</body>
</html>
